; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (domain sailing)
     (:requirements :typing :fluents)
     (:types
          boat person - object
     )
     (:predicates
          (saved ?t - person)
     )
     (:functions
          (x ?b - boat)
          (y ?b - boat)
          (d ?t - person)
     )
     ;; Increment the value in the given counter by one
     (:action go_north_east
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_north_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_est
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 3))
     )
     (:action go_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 3))
     )
     (:action go_south_west
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south_east
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south
          :parameters(?b - boat)
          :precondition (and)
          :effect (and (decrease (y ?b) 2))
     )
     (:action save_person
          :parameters(?b - boat ?t - person)
          :precondition ( and (>= (+ (x ?b) (y ?b)) (d ?t))
               (>= (- (y ?b) (x ?b)) (d ?t))
               (<= (+ (x ?b) (y ?b)) (+ (d ?t) 25))
               (<= (- (y ?b) (x ?b)) (+ (d ?t) 25))
          )
          :effect (and(saved ?t))
     )

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_15_15)

	(:domain sailing)

	(:objects
		b0 b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 - boat
		p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 - person
	)

  (:init
		(= (x b0) 7)
(= (y b0) 0)
(= (x b1) 9)
(= (y b1) 0)
(= (x b2) -1)
(= (y b2) 0)
(= (x b3) 8)
(= (y b3) 0)
(= (x b4) 10)
(= (y b4) 0)
(= (x b5) -4)
(= (y b5) 0)
(= (x b6) 3)
(= (y b6) 0)
(= (x b7) -5)
(= (y b7) 0)
(= (x b8) 10)
(= (y b8) 0)
(= (x b9) 8)
(= (y b9) 0)
(= (x b10) 6)
(= (y b10) 0)
(= (x b11) -1)
(= (y b11) 0)
(= (x b12) 3)
(= (y b12) 0)
(= (x b13) -7)
(= (y b13) 0)
(= (x b14) 8)
(= (y b14) 0)

		(= (d p0) 78)
(= (d p1) 57)
(= (d p2) 83)
(= (d p3) 27)
(= (d p4) 70)
(= (d p5) 99)
(= (d p6) 67)
(= (d p7) 69)
(= (d p8) 97)
(= (d p9) 45)
(= (d p10) 16)
(= (d p11) 85)
(= (d p12) 60)
(= (d p13) 49)
(= (d p14) 88)

	)

	(:goal
		(and
			(saved p0)
(saved p1)
(saved p2)
(saved p3)
(saved p4)
(saved p5)
(saved p6)
(saved p7)
(saved p8)
(saved p9)
(saved p10)
(saved p11)
(saved p12)
(saved p13)
(saved p14)
		)
	)
)

; plan
1. (go_north_east b11)
   changed: (x b11) from -1 to 0.5, (y b11) from 0 to 1.5
   goals met: 0 of 15
2. (go_north_east b11)
   changed: (x b11) from 0.5 to 2, (y b11) from 1.5 to 3
   goals met: 0 of 15
3. (go_north_east b11)
   changed: (x b11) from 2 to 3.5, (y b11) from 3 to 4.5
   goals met: 0 of 15
4. (go_north_east b11)
   changed: (x b11) from 3.5 to 5, (y b11) from 4.5 to 6
   goals met: 0 of 15
5. (go_north_east b11)
   changed: (x b11) from 5 to 6.5, (y b11) from 6 to 7.5
   goals met: 0 of 15
6. (go_north_east b11)
   changed: (x b11) from 6.5 to 8, (y b11) from 7.5 to 9
   goals met: 0 of 15
7. (go_north_east b11)
   changed: (x b11) from 8 to 9.5, (y b11) from 9 to 10.5
   goals met: 0 of 15
8. (go_north_east b11)
   changed: (x b11) from 9.5 to 11, (y b11) from 10.5 to 12
   goals met: 0 of 15
9. (go_north_east b11)
   changed: (x b11) from 11 to 12.5, (y b11) from 12 to 13.5
   goals met: 0 of 15
10. (go_north_east b11)
   changed: (x b11) from 12.5 to 14, (y b11) from 13.5 to 15
   goals met: 0 of 15
11. (go_north_east b11)
   changed: (x b11) from 14 to 15.5, (y b11) from 15 to 16.5
   goals met: 0 of 15
12. (go_north_east b11)
   changed: (x b11) from 15.5 to 17, (y b11) from 16.5 to 18
   goals met: 0 of 15
13. (go_north_east b11)
   changed: (x b11) from 17 to 18.5, (y b11) from 18 to 19.5
   goals met: 0 of 15
14. (go_north_east b11)
   changed: (x b11) from 18.5 to 20, (y b11) from 19.5 to 21
   goals met: 0 of 15
15. (go_north_east b11)
   changed: (x b11) from 20 to 21.5, (y b11) from 21 to 22.5
   goals met: 0 of 15
16. (go_north_east b11)
   changed: (x b11) from 21.5 to 23, (y b11) from 22.5 to 24
   goals met: 0 of 15
17. (go_west b11)
   changed: (x b11) from 23 to 20
   goals met: 0 of 15
18. (go_west b11)
   changed: (x b11) from 20 to 17
   goals met: 0 of 15
19. (go_west b11)
   changed: (x b11) from 17 to 14
   goals met: 0 of 15
20. (go_west b11)
   changed: (x b11) from 14 to 11
   goals met: 0 of 15
21. (go_west b11)
   changed: (x b11) from 11 to 8
   goals met: 0 of 15
22. (go_north_east b11)
   changed: (x b11) from 8 to 9.5, (y b11) from 24 to 25.5
   goals met: 0 of 15
23. (go_north_east b11)
   changed: (x b11) from 9.5 to 11, (y b11) from 25.5 to 27
   goals met: 0 of 15
24. (go_north_east b11)
   changed: (x b11) from 11 to 12.5, (y b11) from 27 to 28.5
   goals met: 0 of 15
25. (go_north_east b11)
   changed: (x b11) from 12.5 to 14, (y b11) from 28.5 to 30
   goals met: 0 of 15
26. (go_north_east b11)
   changed: (x b11) from 14 to 15.5, (y b11) from 30 to 31.5
   goals met: 0 of 15
27. (go_west b11)
   changed: (x b11) from 15.5 to 12.5
   goals met: 0 of 15
28. (go_west b11)
   changed: (x b11) from 12.5 to 9.5
   goals met: 0 of 15
29. (go_west b11)
   changed: (x b11) from 9.5 to 6.5
   goals met: 0 of 15
30. (go_west b11)
   changed: (x b11) from 6.5 to 3.5
   goals met: 0 of 15
31. (go_north_east b11)
   changed: (x b11) from 3.5 to 5, (y b11) from 31.5 to 33
   goals met: 0 of 15
32. (go_north_east b11)
   changed: (x b11) from 5 to 6.5, (y b11) from 33 to 34.5
   goals met: 0 of 15
33. (go_north_east b11)
   changed: (x b11) from 6.5 to 8, (y b11) from 34.5 to 36
   goals met: 0 of 15
34. (go_north_east b11)
   changed: (x b11) from 8 to 9.5, (y b11) from 36 to 37.5
   goals met: 0 of 15
35. (save_person b11 p3)
   added: (saved p3)
   goals met: 1 of 15
36. (go_west b11)
   changed: (x b11) from 9.5 to 6.5
   goals met: 1 of 15
37. (go_west b11)
   changed: (x b11) from 6.5 to 3.5
   goals met: 1 of 15
38. (save_person b11 p10)
   added: (saved p10)
   goals met: 2 of 15
39. (go_north_east b11)
   changed: (x b11) from 3.5 to 5, (y b11) from 37.5 to 39
   goals met: 2 of 15
40. (go_north_east b11)
   changed: (x b11) from 5 to 6.5, (y b11) from 39 to 40.5
   goals met: 2 of 15
41. (go_north_east b11)
   changed: (x b11) from 6.5 to 8, (y b11) from 40.5 to 42
   goals met: 2 of 15
42. (go_north_east b11)
   changed: (x b11) from 8 to 9.5, (y b11) from 42 to 43.5
   goals met: 2 of 15
43. (go_north_east b11)
   changed: (x b11) from 9.5 to 11, (y b11) from 43.5 to 45
   goals met: 2 of 15
44. (go_north_east b11)
   changed: (x b11) from 11 to 12.5, (y b11) from 45 to 46.5
   goals met: 2 of 15
45. (go_north_east b11)
   changed: (x b11) from 12.5 to 14, (y b11) from 46.5 to 48
   goals met: 2 of 15
46. (go_north_east b11)
   changed: (x b11) from 14 to 15.5, (y b11) from 48 to 49.5
   goals met: 2 of 15
47. (go_north_east b11)
   changed: (x b11) from 15.5 to 17, (y b11) from 49.5 to 51
   goals met: 2 of 15
48. (go_north_west b11)
   changed: (x b11) from 17 to 15.5, (y b11) from 51 to 52.5
   goals met: 2 of 15
49. (go_north_west b11)
   changed: (x b11) from 15.5 to 14, (y b11) from 52.5 to 54
   goals met: 2 of 15
50. (go_north_west b11)
   changed: (x b11) from 14 to 12.5, (y b11) from 54 to 55.5
   goals met: 2 of 15
51. (go_north_west b11)
   changed: (x b11) from 12.5 to 11, (y b11) from 55.5 to 57
   goals met: 2 of 15
52. (save_person b11 p9)
   added: (saved p9)
   goals met: 3 of 15
53. (go_north_east b11)
   changed: (x b11) from 11 to 12.5, (y b11) from 57 to 58.5
   goals met: 3 of 15
54. (go_north_east b11)
   changed: (x b11) from 12.5 to 14, (y b11) from 58.5 to 60
   goals met: 3 of 15
55. (go_north_west b11)
   changed: (x b11) from 14 to 12.5, (y b11) from 60 to 61.5
   goals met: 3 of 15
56. (save_person b11 p13)
   added: (saved p13)
   goals met: 4 of 15
57. (go_north_east b11)
   changed: (x b11) from 12.5 to 14, (y b11) from 61.5 to 63
   goals met: 4 of 15
58. (go_north_east b11)
   changed: (x b11) from 14 to 15.5, (y b11) from 63 to 64.5
   goals met: 4 of 15
59. (go_north_west b11)
   changed: (x b11) from 15.5 to 14, (y b11) from 64.5 to 66
   goals met: 4 of 15
60. (go_north_west b11)
   changed: (x b11) from 14 to 12.5, (y b11) from 66 to 67.5
   goals met: 4 of 15
61. (go_north_west b11)
   changed: (x b11) from 12.5 to 11, (y b11) from 67.5 to 69
   goals met: 4 of 15
62. (save_person b11 p1)
   added: (saved p1)
   goals met: 5 of 15
63. (go_north_west b11)
   changed: (x b11) from 11 to 9.5, (y b11) from 69 to 70.5
   goals met: 5 of 15
64. (save_person b11 p12)
   added: (saved p12)
   goals met: 6 of 15
65. (go_north_west b11)
   changed: (x b11) from 9.5 to 8, (y b11) from 70.5 to 72
   goals met: 6 of 15
66. (go_north_west b11)
   changed: (x b11) from 8 to 6.5, (y b11) from 72 to 73.5
   goals met: 6 of 15
67. (save_person b11 p6)
   added: (saved p6)
   goals met: 7 of 15
68. (go_north_west b11)
   changed: (x b11) from 6.5 to 5, (y b11) from 73.5 to 75
   goals met: 7 of 15
69. (save_person b11 p4)
   added: (saved p4)
   goals met: 8 of 15
70. (save_person b11 p7)
   added: (saved p7)
   goals met: 9 of 15
71. (go_north_west b11)
   changed: (x b11) from 5 to 3.5, (y b11) from 75 to 76.5
   goals met: 9 of 15
72. (go_north_west b11)
   changed: (x b11) from 3.5 to 2, (y b11) from 76.5 to 78
   goals met: 9 of 15
73. (go_north_west b11)
   changed: (x b11) from 2 to 0.5, (y b11) from 78 to 79.5
   goals met: 9 of 15
74. (save_person b11 p0)
   added: (saved p0)
   goals met: 10 of 15
75. (go_north_east b11)
   changed: (x b11) from 0.5 to 2, (y b11) from 79.5 to 81
   goals met: 10 of 15
76. (go_north_west b11)
   changed: (x b11) from 2 to 0.5, (y b11) from 81 to 82.5
   goals met: 10 of 15
77. (go_north_west b11)
   changed: (x b11) from 0.5 to -1, (y b11) from 82.5 to 84
   goals met: 10 of 15
78. (save_person b11 p2)
   added: (saved p2)
   goals met: 11 of 15
79. (go_north_east b11)
   changed: (x b11) from -1 to 0.5, (y b11) from 84 to 85.5
   goals met: 11 of 15
80. (save_person b11 p11)
   added: (saved p11)
   goals met: 12 of 15
81. (go_north_east b11)
   changed: (x b11) from 0.5 to 2, (y b11) from 85.5 to 87
   goals met: 12 of 15
82. (go_north_east b11)
   changed: (x b11) from 2 to 3.5, (y b11) from 87 to 88.5
   goals met: 12 of 15
83. (go_north_east b11)
   changed: (x b11) from 3.5 to 5, (y b11) from 88.5 to 90
   goals met: 12 of 15
84. (go_north_east b11)
   changed: (x b11) from 5 to 6.5, (y b11) from 90 to 91.5
   goals met: 12 of 15
85. (go_north_east b11)
   changed: (x b11) from 6.5 to 8, (y b11) from 91.5 to 93
   goals met: 12 of 15
86. (go_north_west b11)
   changed: (x b11) from 8 to 6.5, (y b11) from 93 to 94.5
   goals met: 12 of 15
87. (save_person b11 p14)
   added: (saved p14)
   goals met: 13 of 15
88. (go_north_west b11)
   changed: (x b11) from 6.5 to 5, (y b11) from 94.5 to 96
   goals met: 13 of 15
89. (go_north_west b11)
   changed: (x b11) from 5 to 3.5, (y b11) from 96 to 97.5
   goals met: 13 of 15
90. (go_north_west b11)
   changed: (x b11) from 3.5 to 2, (y b11) from 97.5 to 99
   goals met: 13 of 15
91. (save_person b11 p8)
   added: (saved p8)
   goals met: 14 of 15
92. (go_north_west b11)
   changed: (x b11) from 2 to 0.5, (y b11) from 99 to 100.5
   goals met: 14 of 15
93. (save_person b11 p5)
   added: (saved p5)
   goals met: 15 of 15
